# SymbolGeometryId Properties

---
The SymbolGeometryId type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SymbolId|  The id of the symbol which contains the shared geometry.
Top
#### Reference
SymbolGeometryId Class
Autodesk.Revit.DB Namespace